TexasInstruments/CC26XX-TCAN4550-EXAMPLES/source/ti/can/tcan4x5x/TCAN4x5x_Data_Structs.h
/*
 * TCAN4x5x_Data_Structs.h
 * Description: This file contains the structures and enumerations that the TCAN4550 library will use
 *
 *
 * Copyright (c) 2019 Texas Instruments Incorporated.  All rights reserved.
 * Software License Agreement
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * Redistributions of source code must retain the above copyright
 * notice, this list of conditions and the following disclaimer.
 *
 * Redistributions in binary form must reproduce the above copyright
 * notice, this list of conditions and the following disclaimer in the
 * documentation and/or other materials provided with the
 * distribution.
 *
 * Neither the name of Texas Instruments Incorporated nor the names of
 * its contributors may be used to endorse or promote products derived
 * from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
 * OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
 * SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
 * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
 * THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */


#ifndef TCAN4X5X_DATA_STRUCTS_H_
#define TCAN4X5X_DATA_STRUCTS_H_

// ~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*
//                   Starting with the MCAN Data Structures
// ~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*



/**
 * @brief Used to setup the data timing parameters of the MCAN module
 * This is a simplified struct, requiring only the prescaler value (1:x), number of time quanta before and after the sample point.
 */
typedef struct
{
    //! @brief Prescaler value, interpreted as 1:x
    //! \n Valid range is: 1 to 32
    uint8_t DataBitRatePrescaler : 6;

    //! @brief DTQBSP: Number of time quanta before sample point
    //! \n Valid values are: 2 to 33
    uint8_t DataTqBeforeSamplePoint : 6;

    //! @brief DTQASP: Number of time quanta after sample point
    //! \n Valid values are: 1 to 16
    uint8_t DataTqAfterSamplePoint : 5;

} TCAN4x5x_MCAN_Data_Timing_Simple;


/**
 * @brief Used to setup the timing parameters of the MCAN module
 * This is the raw MCAN form of the struct which takes in the same values as the actual Bosch MCAN core
 */
typedef struct
{
    //! @brief DBRP: The prescaler value from the MCAN system clock. Interpreted by MCAN as the value is this field + 1
    //! \n Valid range is: 0 to 31
    uint8_t DataBitRatePrescaler : 5;

    //! @brief DTSEG1: Data time segment 1 + prop segment value. Interpreted by MCAN as the value in this field + 1
    //! \n Valid values are: 0 to 31
    uint8_t DataTimeSeg1andProp : 5;

    //! @brief DTSEG2: Data time segment 2. Interpreted by MCAN as the value is this field + 1
    //! \n Valid values are: 0 to 15
    uint8_t DataTimeSeg2 : 4;

    //! @brief DSJW: Data Resynchronization jump width. Interpreted by MCAN as the value is this field + 1
    //! \n Valid values are: 0 to 15
    uint8_t DataSyncJumpWidth : 4;

    //! @brief TDCO: Transmitter delay compensation offset
    //! \n Valid values are 0 to 127 mtq
    uint8_t TDCOffset : 7;

    //! @brief TDCFilter: Transmitter delay compensation Filter Window Length
    //! \n Valid values are 0 to 127 mtq
    uint8_t TDCFilter : 7;

} TCAN4x5x_MCAN_Data_Timing_Raw;


/**
 * @brief Used to setup the nominal timing parameters of the MCAN module
 * This is a simplified struct, requiring only the prescaler value (1:x), number of time quanta before and after the sample point.
 */
typedef struct
{
    //! @brief NBRP: The prescaler value from the MCAN system clock. Value interpreted as 1:x
    //! \n Valid range is: 1 to 512
    uint16_t NominalBitRatePrescaler : 10;

    //! @brief NTQBSP: The total number of time quanta prior to sample point
    //! \n Valid values are: 2 to 257
    uint16_t NominalTqBeforeSamplePoint : 9;

    //! @brief NTQASP: The total number of time quanta after the sample point
    //!\n Valid values are: 2 to 128
    uint8_t NominalTqAfterSamplePoint : 8;

} TCAN4x5x_MCAN_Nominal_Timing_Simple;


/**
 * @brief Used to setup the nominal timing parameters of the MCAN module
 * This is the raw MCAN form of the struct which takes in the same values as the actual Bosch MCAN core
 */
typedef struct
{
    //! @brief NBRP: The prescaler value from the MCAN system clock. Interpreted by MCAN as the value is this field + 1
    //! \n Valid range is: 0 to 511
    uint16_t NominalBitRatePrescaler : 9;

    //! @brief NTSEG1: Data time segment 1 + prop segment value. Interpreted by MCAN as the value is this field + 1
    //! \n Valid values are: 0 to 255
    uint8_t NominalTimeSeg1andProp : 8;

    //! @brief NTSEG2: Data time segment 2. Interpreted by MCAN as the value is this field + 1
    //! \n Valid values are: 0 to 127
    uint8_t NominalTimeSeg2 : 7;

    //! @brief NSJW: Nominal time Resynchronization jump width. Interpreted by MCAN as the value is this field + 1
    //! \n Valid values are: 0 to 127
    uint8_t NominalSyncJumpWidth : 7;
} TCAN4x5x_MCAN_Nominal_Timing_Raw;


/**
 * @brief Data payload defines for the different MRAM sections, used by the @c TCAN4x5x_MRAM_Config struct
 */
typedef enum
{
    //! 8 bytes of data payload
    MRAM_8_Byte_Data = 0,

    //! 12 bytes of data payload
    MRAM_12_Byte_Data = 0x1,

    //! 16 bytes of data payload
    MRAM_16_Byte_Data = 0x2,

    //! 20 bytes of data payload
    MRAM_20_Byte_Data = 0x3,

