TexasInstruments/CC26XX-TCAN4550-EXAMPLES/source/ti/can/tcan4x5x/TCAN4x5x_Data_Structs.h
    //! 24 bytes of data payload
    MRAM_24_Byte_Data = 0x4,

    //! 32 bytes of data payload
    MRAM_32_Byte_Data = 0x5,

    //! 48 bytes of data payload
    MRAM_48_Byte_Data = 0x6,

    //! 64 bytes of data payload
    MRAM_64_Byte_Data = 0x7
} TCAN4x5x_MRAM_Element_Data_Size;

/**
 * @brief Defines the number of MRAM elements and the size of the elements
 */
typedef struct
{
    /************************
     *    Filter Elements   *
     ************************/

    //! @brief Standard ID Number of Filter Elements: The number of 11-bit filters the user would like
    //! \n Valid range is: 0 to 128
    uint8_t SIDNumElements : 8;

    //! @brief Extended ID Number of Filter Elements: The number of 29-bit filters the user would like
    //! \n Valid range is: 0 to 64
    uint8_t XIDNumElements : 7;


    /************************
     *  RX FIFO Elements    *
     ************************/

    //! @brief RX FIFO 0 number of elements: The number of elements for the RX FIFO 0
    //! \n Valid range is: 0 to 64
    uint8_t Rx0NumElements : 7;

    //! @brief RX FIFO 0 element size: The number of bytes for the RX 0 FIFO (data payload)
    TCAN4x5x_MRAM_Element_Data_Size Rx0ElementSize : 3;

    //! @brief RX FIFO 1 number of elements: The number of elements for the RX FIFO 1
    //!\n Valid range is: 0 to 64
    uint8_t Rx1NumElements : 7;

    //! @brief RX FIFO 1 element size: The number of bytes for the RX 1 FIFO (data payload)
    TCAN4x5x_MRAM_Element_Data_Size Rx1ElementSize : 3;

    //! @brief RX Buffers number of elements: The number of elements for the RX Buffers (Not the FIFO)
    //! \n Valid range is: 0 to 64
    uint8_t RxBufNumElements : 7;

    //! @brief RX Buffers element size: The number of bytes for the RX Buffers (data payload), not the FIFO
    TCAN4x5x_MRAM_Element_Data_Size RxBufElementSize : 3;

    /************************
     *  TX Buffer Elements  *
     ************************/

    //! @brief TX Event FIFO number of elements: The number of elements for the TX Event FIFO
    //! \n Valid range is: 0 to 32
    uint8_t TxEventFIFONumElements : 6;

    //! @brief TX Buffers number of elements: The number of elements for the TX Buffers
    //! \n Valid range is: 0 to 32
    uint8_t TxBufferNumElements : 6;

    //! @brief TX Buffers element size: The number of bytes for the TX Buffers (data payload)
    TCAN4x5x_MRAM_Element_Data_Size TxBufferElementSize : 3;

} TCAN4x5x_MRAM_Config;


/**
 * @brief struct containing the bit fields of the MCAN CCCR register
 */
typedef struct
{
    union
    {
        //! @brief Full register as single 32-bit word
        uint32_t word;

        struct
        {
            //! @brief Reserved (0)
            uint8_t reserved : 2;

            //! @brief ASM: Restricted Operation Mode. The device can only listen to CAN traffic and acknowledge, but not send anything.
            uint8_t ASM : 1;

            //! @brief Reserved (0)
            uint8_t reserved2 : 1;

            //! @brief CSR: Clock stop request
            uint8_t CSR : 1;

            //! @brief MON: Bus monitoring mode. The device may only listen to CAN traffic, and is not allowed to acknowledge or send error frames.
            uint8_t MON : 1;

            //! @brief DAR: Disable automatic retransmission. If a transmission errors, gets a NACK, or loses arbitration, the MCAN controller will NOT try to transmit again
            uint8_t DAR : 1;

            //! @brief TEST: MCAN Test mode enable
            uint8_t TEST : 1;

            //! @brief FDOE: Can FD mode enabled, master enable for CAN FD support
            uint8_t FDOE : 1;

            //! @brief BRSE: Bit rate switch enabled for can FD. Master enable for bit rate switching support
            uint8_t BRSE : 1;

            //! @brief Reserved (0)
            uint8_t reserved3 : 2;

            //! @brief PXHD: Protocol exception handling disable
            //! \n 0 = Protocol exception handling enabled [default]
            //! \n 1 = protocol exception handling disabled
            uint8_t PXHD : 1;

            //! @brief EFBI: Edge filtering during bus integration. 0 Disables this [default]
            uint8_t EFBI : 1;

            //! @brief TXP: Transmit Pause Enable: Pause for 2 can bit times before next transmission
            uint8_t TXP : 1;

            //! @brief NSIO: Non Iso Operation
            //! \n 0: CAN FD frame format according to ISO 11898-1:2015 [default]
            //! \n 1: CAN FD frame format according to Bosch CAN FD Spec v1
            uint8_t NISO : 1;
        };
    };
} TCAN4x5x_MCAN_CCCR_Config;



/**
 * @brief Struct containing the MCAN interrupt bit field
 */
typedef struct
{
    union
    {
        //! @brief Full register as single 32-bit word
        uint32_t word;
        struct
        {
            //! @brief IR[0] RF0N: Rx FIFO 0 new message
            uint8_t RF0N : 1;

            //! @brief IR[1] RF0W: Rx FIFO 0 watermark reached
            uint8_t RF0W : 1;

            //! @brief IR[2] RF0F: Rx FIFO 0 full
            uint8_t RF0F : 1;

            //! @brief IR[3] RF0L: Rx FIFO 0 message lost
            uint8_t RF0L : 1;

            //! @brief IR[4] RF1N: Rx FIFO 1 new message
            uint8_t RF1N : 1;

            //! @brief IR[5]  RF1W: RX FIFO 1 watermark reached
            uint8_t RF1W : 1;

            //! @brief IR[6] RF1F: Rx FIFO 1 full
            uint8_t RF1F : 1;

            //! @brief IR[7] RF1L: Rx FIFO 1 message lost
            uint8_t RF1L : 1;

            //! @brief IR[8] HPM: High priority message
            uint8_t HPM : 1;

            //! @brief IR[9] TC: Transmission completed
            uint8_t TC : 1;

            //! @brief IR[10] TCF: Transmission cancellation finished
            uint8_t TCF : 1;

            //! @brief IR[11] TFE: Tx FIFO Empty
            uint8_t TFE : 1;

            //! @brief IR[12] TEFN: Tx Event FIFO new entry
            uint8_t TEFN : 1;

            //! @brief IR[13] TEFW: Tx Event FIFO water mark reached
            uint8_t TEFW : 1;

            //! @brief IR[14] TEFF: Tx Event FIFO full
            uint8_t TEFF : 1;

            //! @brief IR[15] TEFL: Tx Event FIFO element lost
            uint8_t TEFL : 1;

            //! @brief IR[16] TSW: Timestamp wrapped around
            uint8_t TSW : 1;

            //! @brief IR[17] MRAF: Message RAM access failure
            uint8_t MRAF : 1;

